---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSweepWallOffsetParam
source: html/15e1b6d5-1112-6346-a10d-58c35f35e079.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSweepWallOffsetParam Property

"Offset From Wall"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSweepWallOffsetParam { get; }
```